Revit 2024 API
FabricationPartCompareType Enumeration
 Fabrication Part Comparison Types
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public enum FabricationPartCompareType
Visual Basic
Public Enumeration FabricationPartCompareType
Visual C++
public enum class FabricationPartCompareType
Members
Member name | Description
CutType |  Compare Fabrication Cut Type data.
Material |  Compare Fabrication Material.
Specification |  Compare Fabrication Specification.
InsulationSpecification |  Compare Fabrication Insulation Specification.
MaterialGauge |  Compare Fabrication Material's Gauge.
DuctFacing |  Compare Fabrication Duct Facing Type.
Insulation |  Compare Fabrication Insulation Material.
Notes |  Compare Fabrication Notes field.
Filename |  Compare Fabrication Item Filename.
Description |  Compare Fabrication Description Field.
CID |  Compare Fabrication Custom Identifier (CID) number.
SkinMaterial |  Compare Fabrication Double Skin Material.
SkinGauge |  Compare Fabrication Double Skin Material Gauge.
Section |  Compare Fabrication Section field.
Status |  Compare Fabrication Status.
Service |  Compare Fabrication Service.
Pallet |  Compare Fabrication Pallet field.
BoxNo |  Compare Fabrication Box Number field.
OrderNo |  Compare Fabrication Order Number field.
Drawing |  Compare Fabrication Drawing name field.
Zone |  Compare Fabrication Zone field.
ETag |  Compare Fabrication ETag field.
Alt |  Compare Fabrication Alt field.
Spool |  Compare Fabrication Spool name field.
Alias |  Compare Fabrication Alias field.
PCFKey |  Compare Fabrication PCFKey field.
CustomData |  Compare all Fabrication Custom Data fields.
ButtonAlias |  Compare Fabrication Button Alias field.
See Also
Autodesk.Revit.DB.Fabrication Namespace